#Пользователь вводит целое число. Выведите его строку-описание вида "отрицательное четное число", 
#"нулевое число", "положительное нечетное число", например, численным описанием числа 190 является строка
# "положительное четное число". Если число не является четным - выведите сообщение "число не является четным"

#Решение задания:

a = int(input("Введите число, и нажмите Enter "))

if ((a%2) != 0) and ((a/2)>0):

    print("положительное нечетное число")

if (a%2 == 0) and ((a/2)>0):

    print("положительное четное число")

elif (a%2 == 0) and ((a/2)<0):

    print("отрицательное четное число")

elif (a%2 != 0) and ((a/2)<0):

    print("отрицательное нечетное число")

elif (a/2 == 0):

    print("нулевое число")
    